{
  "id": 1,
  "date": 1697741496,
  "title": "Linguagem Java",
  "excerpt": "Entenda a linguagem Java, suas características e o que a torna uma das linguagens de programação mais utilizadas e famosas da história da computação!",
  "slug": "linguagem-java",
  "category_id": 1,
  "idioms_id": 1,
  "featured_image_url": "/imagens/posts/_covers/2019/java-cover.webp",
  "content": "<h2>Introdução</h2>\n        <div class=\"_grid _2_cols_grid_B\">\n            <div>\n                <img src=\"[[[filebucket]]]/imagens/posts/2019/linguagem-java/java-01.webp\" alt=\"java\" width=\"288\" height=\"171\">\n            </div>\n            <div>\n                <p>Lançada originalmente em 1995, pela <a href=\"https://pt.wikipedia.org/wiki/Sun_Microsystems\" target=\"_blank\" rel=\"noopener noreferrer\" aria-label=\"Leia mais a respeito.\">Sun Microsystems</a>, a linguagem Java é uma das linguagens de programação mais famosas e mais utilizadas pelos desenvolvedores iniciantes. No mercado de desenvolvimento de softwares, o Java é amplamente utilizado devido ao seu grande poder de realização, maior facilidade de uso e menor curva de aprendizado.</p>\n            </div>\n        </div>\n        <p>Atualmente a linguagem pertence à empresa <a href=\"https://www.oracle.com/br/index.html\" target=\"_blank\" rel=\"noopener noreferrer\" aria-label=\"Leia mais a respeito.\">Oracle</a> e se mantém muito forte. Ainda desponta como primeira colocada no Ranking das linguagens de programação mais utilizadas em todo o mundo (segundo o <a href=\"https://www.tiobe.com/tiobe-index/\" target=\"_blank\" rel=\"noopener noreferrer\" aria-label=\"Leia mais a respeito.\">índice TIOBE</a>).</p>\n        <p>Mas, por que será que ela é tão famosa? Por que deu tão certo no mercado? O que a torna tão utilizada pelos mais variados tipos de desenvolvedores de aplicações?</p>\n        <p>Bem! Para responder a esses questionamentos precisamos conhecer as características dessa linguagem de programação.</p>\n        <p><a href=\"[[[domain]]]/linguagens-programacao-o-que-sao/\" target=\"_blank\" aria-label=\"Leia mais a respeito.\">Se você ainda não está familiarizado com o conceito de linguagem de programação, clique neste link e veja o artigo em que te explicamos com bastante detalhes sobre o assunto.</a></p>\n        \n        <hr>\n\n        <h2>O Java funciona em qualquer lugar!</h2>\n        <p>\n            O Java é uma linguagem de programação multiplataforma. Isso significa que o programador escreve um único código fonte do seu programa e consegue executá-lo em vários sistemas operacionais diferentes, sem quase realizar nenhum tipo de ajuste ou adaptação. Este é o conceito que chamamos de portabilidade: a capacidade de ser portável e adaptar-se a outros ambientes de maneira natural. Em resumo: o programador escreve o código apenas uma vez e o executa em qualquer lugar.\n        </p>\n        <div class=\"_grid _2_cols_grid_A\">\n            <div>\n                <div><img class=\"full-size-img-mobile\" src=\"[[[filebucket]]]/imagens/posts/2019/linguagem-java/java-02a.webp\" alt=\"java\" width=\"350\" height=\"252\"></div>\n                <p class=\"description\">O Java funciona no Windows</p>\n            </div>\n            <div>\n                <div><img class=\"full-size-img-mobile\" src=\"[[[filebucket]]]/imagens/posts/2019/linguagem-java/java-02b.webp\" alt=\"java\" width=\"350\" height=\"252\"></div>\n                <p class=\"description\">Funciona no sistema Linux</p>\n            </div>\n            <div>\n                <div><img class=\"full-size-img-mobile\" src=\"[[[filebucket]]]/imagens/posts/2019/linguagem-java/java-02c.webp\" alt=\"java\" width=\"350\" height=\"252\"></div>\n                <p class=\"description\">Funciona no seu Celular Android</p>\n            </div>\n            <div>\n                <div><img class=\"full-size-img-mobile\" src=\"[[[filebucket]]]/imagens/posts/2019/linguagem-java/java-02d.webp\" alt=\"java\" width=\"350\" height=\"252\"></div>\n                <p class=\"description\">Funciona até no Mac OS</p>\n            </div>\n        </div>\n        <p>Mas isso não acontece por mágica. O grande responsável por dar à linguagem essa capacidade de adaptação a vários ambientes diferentes é a sua Máquina Virtual.</p>\n        <p>Um programa escrito em Java não é executado diretamente pelo sistema operacional, como são executados os programas tradicionais. Existe uma aplicação denominada Máquina Virtual Java (JVM) que faz com que um programa escrito na linguagem seja adaptável aos mais diversos tipos de sistemas.</p>\n        <p>A imagem abaixo ilustra a função da JVM. Ela funciona como uma espécie de intermediador entre a execução do código Java e o sistema operacional. O código do programa que você escreveu é naturalmente interpretado pela Máquina Virtual e executado nos diversos sistemas operacionais. Todo trabalho de adaptação para as particularidades do sistema é feito pela JVM.</p>\n        <img class=\"full-size-img-mobile\" src=\"[[[filebucket]]]/imagens/posts/2019/linguagem-java/java-03.webp\" alt=\"java\" width=\"510\" height=\"253\">\n        <div class=\"separator-1\"></div>\n        <p>A JVM não precisa ser configurada pelo programador. Ela pode ser obtida gratuitamente no site da Oracle e já vem pronta para ser usada e interpretar os programas escritos na linguagem.</p>\n\n        <hr>\n\n        <h2>Os programas escritos em Java são rápidos?</h2>\n        <p>Apesar da portabilidade e adaptação aos diversos sistemas operacionais, as aplicações Java são um pouco mais lentas que as aplicações tradicionais...</p>"
}